import json
from random import choice, randrange

def generate_date():
    return f'{randrange(1, 30)}/{randrange(1, 12)}/{randrange(2022, 2023)}' 
vacancies = """Cварщик
Cекретарь
Cиделка
Cтоматолог-терапевт
Cу Шеф
Frontend-разработчик
PR-менеджер
PR-менеджер социальной сферы в коммуникационное агентство
Senior HR Advisor
Senior/Lead C# Developer (Remotely)
SEO-специалист (middle SEO specialist)
Smm-менеджер
WEB-программист (PHP-разработчик)
Web-программист (Битрикс)
Web-программист, верстальщик, дизайнер
Web-разработчик
Web-разработчик (php-программист)
Web-разработчик FrontEnd, BackEnd
Автоводитель
Автоводитель "В, С, Е"
Автоводитель категории "Е"
Автоводитель на служебном автомобиле
Автоводитель такси
Автокрановщик (машинист автокрана)
Автомаляр-подготовщик
Автомеханик
Автомеханик, автослесарь
Автомойщик
Автомойщик (автомойщица)
Автомойщики, автомойщицы
Автоняня к мальчику 5 лет
Автослесарь
Автослесарь, шиномонтажник, сход-развальщик
Автослесарь-автомеханик
Автоэлектрик
Агент
Агент (курьер) доставки
Агент в отдел аренды
Агент по аренде недвижимости
Агент по доставке
Агент по доставке (курьер)
Агент по недвижимости
Агент по недвижимости, риелтор (продажа квартир в ЖК Москвы и МО)
Агент по недвижимости, риэлтор
Агент по поиску клиентов
Агент по продажам и маркетингу
Агент по продаже загородной недвижимости
Агент по продаже недвижимости
Агент по элитной недвижимости
Агентство по патронажу няня-сиделка
Адвокат
Административный помощник руководителя
Администратор
Администратор (охрана)
Администратор (Салон красоты)
Администратор в детский клуб
Администратор в платную клинику
Администратор гостиницы
Администратор доставки пиццы
Администратор магазина
Администратор магазина обуви (м. Алтуфьево)
Администратор мед.центра
Администратор медициского центра
Администратор на телефоне
Администратор офиса
Администратор по клинингу
Администратор по работе со школами
Администратор салона красоты
Администратор салона красоты (м. Пражская)
Администратор Сервисного центра
Администратор службы приема и размещения
Администратор СПА-салона
Администратор торгового зала
Администратор учебного центра
Администратор, менеджер
Администратор, оператор
Администратор-кассир
Администратор-комендант (-ша) в общежитие
Администратор-контролер
Администратор-оператор на телефон в клинику
Администратор-охранник
Администратор-охранник в кафе-караоке
Аккумуляторщик (Солнечногорский р-н)
Актер
Альпинист
Аналитик автоматизированных систем на платформе 1С
Аналитик отдела продаж
Аппаратчик термической обработки
Аппаратчик термической обработки мясопродуктов
Аппаратчик-краскотер
Арбитр по гражданским спорам
Арматурщик
Арматурщик-бетонщик
Архивист
Архитектурный макетчик, помощник архитектора
Ассистент врача-стоматолога
Ассистент маркетолога по работе с SEO и контекстной рекламой
Ассистент менеджера
Ассистент менеджера по персоналу (м. Речной Вокзал)
Ассистент менеджера по продажам
Ассистент менеджера по продажам (без поиска клиентов)
Ассистент отдела межд?ународного маркетинга
Ассистент отдела продаж
Ассистент по документообороту (Production house, postproduction studio)
Ассистент стоматолога
Ассистентка, кастинг-менеджер
Барист
Бариста
Бариста в кофейню
Бармен
Бармен-кассир
Бармен-официант
Бетонщик
Бетонщик, формовщик
Бетонщик-арматурщик
Битрикс-программист
Битрикс-программист (web-разработчик bitrix)
Бренд-менеджер, менеджер по развитию
Бригада каменщиков
Бригада кровельщиков по мягкой кровле
Бригада монолитчиков
Бригада монтажников ОПС, СКС, СКУД
Бригада на благоустройство
Бригада отделочников для внутренней отделки
Бригада отделочников класса VIP
Бригада отделочников-универсалов
Бригада плотников
Бригада разнорабочих (все строительные специальности)
Бригада электромонтажников
Бригадир на склад
Бригадир над грузчиками
Брокер по коммерческой недвижимости
Бухгалтер
Бухгалтер в единственном лице
Бухгалтер на первичную документацию
Бухгалтер на пищеблок
Бухгалтер на участок банк и авансовые отчеты
Бухгалтер по первичной обработке документов
Бухгалтер по расчету заработной платы и кадрам
Бухгалтер, главный бухгалтер
Бухгалтер-калькулятор
Бухгалтер-кассир
Бухгалтер-операционист
Вахтовик охранник
Веб-программист CMS (1С-Bitrix, Joomla; Yii, PHP, JS), web-разработчик
Ведущий менеджер по продажам
Ведущий специалист по продажам
Ведущий специалист по продажам продуктов питания
Ведущий юрисконсульт
Вентиляционщик-жестянщик
Верстальщик
Видеооператор
Визажист-стилист по волосам
Вип-официант
Водителей
Водители
Водители (категория С, Е)
Водители автопогрузчика на склад
Водители в такси UBER
Водители в такси Убер (uber)
Водители кат С, Е на тягач man и scania
Водители кат. Е
Водители кат. С на самосвал man
Водители категории Е
Водители с категорией "Д"
Водители с личным автотранспортом
Водители такси
Водитель
Водитель ( Троицк)
Водитель (категория С)
Водитель UBER, Убер
Водитель Yandex
Водитель Yandex, Яндекс
Водитель автобуса
Водитель автобуса кат "Д"
Водитель автокрана
Водитель автомобиля (автомобиль компании)
Водитель автомобиля КАМАЗ 6520
Водитель автопогрузчика
Водитель бензовоза
Водитель бункеровоза
Водитель в корпоративную колонну бизнес-класс
Водитель в такси
Водитель в такси UBER
Водитель в штат компании
Водитель в штат по приложению Uber
Водитель в Яндекс Такси (г. Москва)
Водитель в Яндекс.Такси
Водитель высотного штабелера на склад
Водитель грузовой техники
Водитель для перевозки грузов
Водитель для перевозки небольших грузов
Водитель для перевозки щебня
Водитель доставки
Водитель кат. "Е"
Водитель кат. С
Водитель категории B,C,D
Водитель категории C
Водитель категории D
Водитель категории В
Водитель категории В (без аренды, плана, залогов)
Водитель категории В,С
Водитель категории Е
Водитель категории Е на авто компании
Водитель категории е на межгород
Водитель категории С
Водитель категории С, Е
Водитель категории С, Е (эвакуатор, автовоз), водитель-экспедитор
Водитель категории с,е
Водитель корпоративного обслуживания
Водитель крана-манипулятора
Водитель легкового автомобиля
Водитель ломовоза
Водитель манипулятора
Водитель микроавтобуса "mercedes-benz"
Водитель на а/м Газель тент
Водитель на авто компании на ЗП
Водитель на автобетоносмеситель
Водитель на автомобиль компании
Водитель на зил(маз)-бункеровоз
Водитель на ЗИЛ-мусоровоз
Водитель на камаз кму (категории в, с, е)
Водитель на корпоративный автобус
Водитель на личном автомобиле в такси
Водитель на личном грузовом автомобиле типа Газель, Портер c рефрижератором
Водитель на мусоровоз
Водитель на своем авто
Водитель на служебный автомобиль
Водитель на спецтехнику
Водитель на тонар
Водитель по доставке пиццы
Водитель погрузчика
Водитель погрузчика на склад
Водитель погрузчика, ричтрака
Водитель погрузчика, штабелерав
Водитель погрузчика-штабелера
Водитель с автомобилем в такси
Водитель с категорией B (со своей машиной)
Водитель с личным автомобилем
Водитель с личным автомобилем в Яндекс Такси, UBER, GETT и Wheely
Водитель с личным грузовым автомобилем
Водитель с личным грузовым автомобилем 5 тонн
Водитель с личным легковым авто
Водитель с своим грузовым автомобилем
Водитель самосвала (МАЗ, 4-х осный)
Водитель самосвала маз 16 кубов
Водитель системы UBER (личный авто)
Водитель системы Yandex
Водитель со знанием охраны труда
Водитель со своим личным автомобилем от 5 тонн
Водитель такси
Водитель такси Gett и Uber
Водитель такси Uber
Водитель такси UBER
Водитель такси без аренды
Водитель такси без аренды и плана
Водитель такси без лицензии
Водитель такси бизнес класса
Водитель такси в Шереметьево
Водитель такси на автомобиле компании
Водитель такси на автомобиль компании
Водитель такси на новые авто
Водитель такси с авто
Водитель такси, г. Москва
Водитель телескопического погрузчика
Водитель Убер в Москве
Водитель штабелера
Водитель эвакуатора
Водитель электропогрузчика
Водитель Яндекс такси
Водитель Яндекс Такси г. Москва
Водитель Яндекс такси с л/а
Водитель Яндекс такси. Москва
Водитель Яндекс.Такси в Москве
Водитель-категория Е на фуру дальнобойщик.
Водитель-курьер
Водитель-курьер в интернет-магазин
Водитель-курьер на личном автомобиле
Водитель-курьер с личным автомобилем
Водитель-международник кат Е
Водительс категорией B,C
Водитель-слесарь
Водитель-экспедитор
Водитель-экспедитор (доставка товаров до торговых объектов)
Водитель-экспедитор Е категории
Водитель-экспедитор кат. "Е"
Водитель-экспедитор кат. С
Водитель-экспедитор катгории Е
Водитель-экспедитор категории "Е"
Водитель-экспедитор категории B, C
Водитель-экспедитор категории В, С
Водитель-экспедитор категории С
Водитель-экспедитор на автомобиль компании
Водитель-экспедитор на Газель (со своей машиной)
Водитель-экспедитор на грузовой автомобиль, категория С
Водитель-экспедитор на цельнометаллическую Газель
Водитель-экспедитор с а/м 5т реф.
Водитель-экспедитор с личным грузовым автомобилем
Водителя на самосвал с категорией СЕ
Военнослужащий по контракту
Волонтер
Воспитатель
Воспитатель в частный детский сад
Воспитатель ГПД
Воспитатель ГПД в НОЧУ СОШ "Интеллект"
Воспитатель детского сада
Врач - стоматолог-терапевт
Врач - стоматолог-универсал
Врач общей практики
Врач терапевт участковый
Врач-гинеколог
Врач-косметолог
Врач-лаборант
Врач-нарколог
Врач-невролог
Врач-оториноларинголог
Врач-психиатр нарколог
Врач-ревматолог
Врач-терапевт
Врач-терапевт дневного стационара
Врач-терапевт участковый, врач-терапевт
Выездной дизайнер - замерщик
Выездной инженер-замерщик
Выездной сервис-инженер
Вышивальщица
Газосварщик
Газоэлектросварщик
Гастрономист
Гид-переводчик и сопровождающий тургрупп
Гидроизолировщик
Главный агроном
Главный бухгалтер
Главный бухгалтер в единственном лице
Главный инженер
Главный инженер проектов (на совмещение)
Главный специалист лаборатории нефтепродуктов
Главный специалист-проектировщик систем электроснабжения ЭО, ЭОМ
Гладильщица
Гладильщица на гладильный каток
Горничная
Горничная (с функцией менеджера по заселению)
Горничная в гостиницу
Горничная в отель
Грузчик
Грузчик - расстановщик товара
Грузчик в аэропорт
Грузчик в аэропорт Внуково
Грузчик на склад
Грузчик на склад одежды и товаров
Грузчик, разнорабочий
Грузчик, РТЗ
Грузчик/Укладчик/вахта
Грузчики
Грузчики-комплектовщики
Грузчики-рабочие по складу
Грузчик-карщик, водитель погрузчика
Грузчик-комплектовщик
Грузчик-комплектовщик вахта в Москве
Грузчик-мерчендайзер
Грузчик-разнорабочий(вахта+жилье+питание)
Грузчик-сборщик
Грузчик-сопроводитель
Грузчик-упаковщик
Дворник
Дежурный администратор
Дежурный диспетчер-кассир
Дежурный официант
Дежурный по предприятию
Дезинфектор
Делопроизводитель, архивариус
Диагност-автоэлектрик
Дизайнер интерьера - чертежник-проектировщик AutoCAD
Дизайнер по шторам
Дизайнер-верстальщик
Дизайнер-программист машинной вышивки
Директолог
Директор аптек
Директор аптеки
Директор гастрольного театра
Директор магазина
Директор магазина Магнит косметик
Директор магазина магнит косметик
Директор магазина Магнит Косметик
Директор склада, складского комплекса
Диспетчер
Диспетчер на домашнем телефоне
Диспетчер на телефон
Диспетчер на телефон (без продаж)
Диспетчер по транспорту
Диспетчер такси
Дистрибьютор, торговый представитель, wifi авторизация
Домработница
Домработница c проживанием
Доставщик-курьер
Доярка
Женский парикмахер
Жиловщик мяса
Журналист
Журналист, корреспондент
Заведующая
Заведующий пекарней
Заведующий производством
Закройщик швейного производства
Замдиректора магазина
Замерщик
Замерщик корпусной и встроенной мебели
Замерщик, менеджер по замерам
Замерщик, менеджер по замеру окон ПВХ
Заместитель генерального директора по развитию
Заместитель главного бухгалтера
Заместитель директора магазина
Засольщик мяса
Заточник
Зубной техник
Изготовитель мясных полуфабрикатов
Изолировщик на термоизоляцию
Инженер АСУ
Инженер в НРС
Инженер материально-технического снабжения
Инженер по обслуживанию терминалов
Инженер по ремонту оргтехники
Инженер по сборке платежных терминалов
Инженер по слаботочным системам
Инженер по снабжению, снабженец
Инженер по тестированию
Инженер по техническому надзору
Инженер ПТО
Инженер ПТО (исполнительная документация на контактную сеть)
Инженер пуско-наладочных работ
Инженер сборочного производства
Инженер слаботочных систем
Инженер строительного контроля
Инженер технической поддержки
Инженер-банкоматчик
Инженер-конструктор
Инженер-наладчик
Инженер-проектировщик
Инженер-проектировщик электроснабжения и слаботочных сетей
Инженер-сметчик
Инженеры-проектировщики (здания и сооружения, все разделы проекта), Москва
Инженер-электрик
Инженер-электронщик (радиотехник)
Инспектор ДПС (дорожно-патрульной службы)
Инспектор торгового зала (Химки)
Инструктор по йоге
Инструктор-аниматор в прокатно-развлекательную зону в ТРЦ
Интернет-маркетолог
Интернет-менеджер по продажам
Искусствовед-галерист
ИТ Специалист
Кадровик
Каменщик
Каменщики
Кассир
Кассир (минимаркет) г. Москва
Кассир (Москва и МО)
Кассир (с обучением)
Кассир в ресторан (м. Автозаводская)
Кассир в ресторан (м. Братиславская)
Кассир в ресторан (м. Домодедовская)
Кассир в ресторан (м. Коньково)
Кассир в ресторан (м. Теплый стан)
Кассир в ресторан (м. Ясенево)
Кассир в ресторан (Новые Черемушки)
Кассир в сеть ресторанов
Кассир вахта в Москве
Кассир на денежные переводы
Кассир, бариста
Кассир-консультант
Кассир-оператор ПК
Кассир-операционист
Кассир-официант
Кассир-раздатчик
Кассир-хостес
Кассиры в супермаркеты
Квалифицированный охранник
Кеттельщица
Кладовщик
Кладовщик склада
Кладовщик-Водитель
Кладовщик-грузчик
Кладовщик-компл?ектовщик, грузчик
Кладовщик-комплектовщик
Кладовщик-комплектовщик на склад, продукты питания в интернет-магазин
Кладовщик-контролер
Кладовщик-маркировщик на склад женской одежды
Кладовщик-отборщик
Кладовщик-приемосдатчик
Кладовщик-сборщик
Клинер, уборщик квартир
Комендант в общежитие
Комендант службы АХО
Комплектовщик
Комплектовщик (вахта)
Комплектовщик (ца)
Комплектовщик (-ца) на склад одежды
Комплектовщик (-ца) продукции в супермаркет
Комплектовщик заказов
Комплектовщик на склад
Комплектовщик на склад готовой продукции
Комплектовщик(-ца), москва
Комплектовщик(ца)-упаковщик(ца)
Комплектовщик, работник склада (Моск.обл., выезд из Пскова)
Комплектовщики заказов, упаковщики
Комплектовщики косметики
Комплектовщики на склад
Кондитер
Кондитер (мастер по пряникам)
Кондитер в пекарню-кондитерскую
Кондитер-пекарь
Конструктор одежды
Конструктор-швея
Консультант 1С
Консультант SAP
Консультант в регионах РФ
Консультант домашнего колл-центра
Консультант по банковским продуктам
Консультант по продажам
Консультант-визажист в лучшую сеть Золотое Яблоко
Консультант-переводчик (китайского и английского языка)
Консультант-промоутер на 6 часов
Консультант-психолог брачного агентства
Контент-менеджер
Контент-менеджер на склад
Контролер
Контролёр (охранник)
Контролер ОТК
Контролер распространителей рекламной продукции
Контролер СВК
Контролер торгового зала
Контролер торгового зала (охранник)
Контролер-охранник торгового зала
Контролеры торгового зала
Координатор
Координатор отдела продаж
Копирайтер
Копровщик
Корпоративный водитель
Косметолог
Косметолог (аппаратный)
Косметолог-врач
Косметолог-эстетист
Костюмер
Котломойщик
Котломойщики
Кредитный менеджер
Кредитный специалист
Кредитный, ипотечный специалист
Кровельщик на жесткую кровлю
Кровельщики-плотники
Курьер
КУРЬЕР
Курьер (доставка каталогов)
Курьер в офис пеший
Курьер выходного дня
Курьер на доставку документации
Курьер на личном автомобиле
Курьер пеший
Курьер по доставке еды из ресторанов
Курьер с ежедневной оплатой
Курьер с личным автомобилем
Курьер срочной доставки
Курьер-водитель
Курьер-распространитель рекламных листовок по п/я
Курьеры
Кухонные работники
Кухонный рабочий
Лифтер
Лифтер-грузчик
Лицензированные охранники
Лицензированные сотрудники охраны
Лицензированный охранник
Лицензированный сотрудник охраны
Логист диспетчер
Макетчик
Макетчик (оклейщик виниловой плёнкой)
Макетчик монтажник наружной рекламы
Макетчик, изготовление рекламы
Макетчик-монтажник
Маляр
Маляр металлоконструкций
Маляр по дереву
Маляр по металлу (в Подмосковье)
Маляр штукатур
Маникюрный мастер
Маркетолог
Маркировщик
Маркировщик (кладовщик)
Маркировщик в хобби-гипермаркет леонардо
Маркировщик товара
Маркировщики
Маркировщицы, упаковщицы
Массажист
Массажист (-ка)
Мастер
Мастер выездной химчистки
Мастер маникюра
Мастер маникюра и педикюра
Мастер маникюра педикюра
Мастер маникюра, педикюра и наращивания ногтей
Мастер маникюра, педикюра, моделирования, мастер ногтевого сервиса
Мастер мебельного производства
Мастер мясного отдела
Мастер на производство
Мастер ногтевого сервиса
Мастер ногтевого сервиса (маникюр, педикюр)
Мастер ногтевого сервиса (маникюр, педикюр, наращивание)
Мастер отделочных работ
Мастер пищевого производства
Мастер по доставке и установке фильтров
Мастер по маникюру и педикюру
Мастер по наращиванию ресниц
Мастер по наращиванию ресниц и коррекции бровей (бровист, лашмейкер, lashmaker)
Мастер по настройке ТВ-каналов
Мастер по настройке тв-каналов
Мастер по обслуживанию кассовой техники
Мастер по обслуживанию кулеров для воды
Мастер по перетяжке салона автомобиля
Мастер по поверке, курьер
Мастер по ремонту (окон ПВХ)
Мастер по ремонту бытовых холодильников
Мастер по ремонту гаджетов
Мастер по ремонту Гаджетов
Мастер по ремонту и обслуживанию ноутбуков и ПК
Мастер по ремонту кондиционеров
Мастер по ремонту контрольно-кассовой техники
Мастер по ремонту кофемашин
Мастер по ремонту крупной бытовой техники
Мастер по ремонту мелкой бытовой техники
Мастер по ремонту ноутбуков и ПК
Мастер по ремонту обуви и изготовлению ключей
Мастер по ремонту одежды
Мастер по ремонту окон пвх
Мастер по ремонту оргтехники
Мастер по ремонту плазм, lcd, led телевизоров
Мастер по ремонту принтеров
Мастер по ремонту СВЧ
Мастер по ремонту стиральных машин
Мастер по ремонту стиральных машин (с обучением)
Мастер по ремонту стиральных, посудомоечных и сушильных машин
Мастер по ремонту телевизоров
Мастер по ремонту телевизоров (стационар)
Мастер по ремонту техники Apple
Мастер по ремонту торг. холод. оборудования
Мастер по ремонту торгового холодильного оборудования
Мастер по ремонту холодильного оборудования
Мастер по ремонту швейного оборудования
Мастер по ремонту электрич. и газовых плит
Мастер по ремонту электрических и газовых плит (возможно обучение)
Мастер по реставрации и ремонту мягкой мебели
Мастер по установке кондиционеров
Мастер по установке крупногабаритной бытовой техники
Мастер СМР
Мастер СМР, прораб
Мастер, производитель работ
Мастера по ремонту одежды
Мастер-бровист
Мастер-машинист буровой установки УРБ-2А2
Мастер-мостовик
Мастер-парикмахер
Мастер-прораб
Мастер-сборщик
Мастер-универсал
Мастер-универсал отделочник
Мастер-электрик
Машинист автокрана (крановщик)
Машинист автомобильного крана-крановщик
Машинист гусеничного крана
Машинист дорожной фрезы
Машинист железнодорожного крана кждэ-25
Машинист крана гусеничного мкг, рдк
Машинист крана-манипулятора
Машинист на гусеничный экскаватор jcb 220
Машинист на экскаватор-погрузчик jcb 3 сх
Машинист на экскаватор-погрузчик jcb 3cx
Машинист сваебойной машины
Машинист строительных машин
Машинист экскаватора
Машинист экскаватора-погрузчика
Машинист экструдера
Медицинская сестра
Медицинская сестра процедурной
Медсестра постовая палатная
Медсестра процедурного кабинета
Медсестра, диспетчер по приему-передаче вызовов
Менеджер
Менеджер активных продаж
Менеджер в отдел автострахования
Менеджер в отдел продаж
Менеджер в отдел рекламаций
Менеджер ВЭД
Менеджер зала
Менеджер инт.-магазина запчастей для быт.техн
Менеджер интернет-магазина
Менеджер интернет-магазина товаров для взрослых
Менеджер кафе
Менеджер контактного центра на международный проект
Менеджер контакт-центра
Менеджер объекта (клининг)
Менеджер оптовых продаж
Менеджер отдела по работе с клиентами
Менеджер отдела продаж
Менеджер отдела технической поддержки (инженер технической службы)
Менеджер по бронированию, менеджер по туризму
Менеджер по заказам
Менеджер по закупкам
Менеджер по закупкам (программное обеспечение)
Менеджер по кадрам
Менеджер по коммуникациям (Менеджер по продажам)
Менеджер по корпоративным продажам, менеджер по продаже автомобилей
Менеджер по кредитованию
Менеджер по кредитованию в д. Мамыри
Менеджер по кредитованию и страхованию
Менеджер по логистике
Менеджер по маркетингу
Менеджер по недвижимости
Менеджер по оптовым продажам
Менеджер по оптовым продажам (молочное сырье)
Менеджер по оптовым продажам (сх продукция)
Менеджер по оптовым продажам оборудования для систем пожаротушения
Менеджер по оптовым продажам, г. Москва
Менеджер по организации выставок-ярмарок
Менеджер по оформлению документов
Менеджер по персоналу
Менеджер по подбору домашнего персонала
Менеджер по подбору персонала
Менеджер по подбору персонала, рекрутер
Менеджер по привлечению клиентов
Менеджер по продажам
Менеджер по продажам (двери,фурнитура)
Менеджер по продажам (младший, помощник)
Менеджер по продажам (область строительства, проектирования и монтажа)
Менеджер по продажам (программное обеспечение)
Менеджер по продажам (проектно-строительное направление)
Менеджер по продажам (услуги B2B)
Менеджер по продажам абонементов
Менеджер по продажам автозапчастей
Менеджер по продажам автомасел
Менеджер по продажам в контакт-центр
Менеджер по продажам в салон связи
Менеджер по продажам в салон сотовой связи
Менеджер по продажам ворот дверей
Менеджер по продажам детской обуви оптом
Менеджер по продажам запорной арматуры, запчастей насосов
Менеджер по продажам запчастей
Менеджер по продажам и по работе с клиентами в сфере разработка сайтов, интернет-маркетинг
Менеджер по продажам и работе с клиентами
Менеджер по продажам кабельно-проводниковой и светотехнической продукции
Менеджер по продажам керамической плитки
Менеджер по продажам контрактных автозапчастей
Менеджер по продажам кухонной мебели
Менеджер по продажам металлообрабатывающего оборудования
Менеджер по продажам металлопроката
Менеджер по продажам металлорежущего инструмента
Менеджер по продажам недвижимости
Менеджер по продажам недвижимости (новостройки и вторичка)
Менеджер по продажам новостроек
Менеджер по продажам оборудования
Менеджер по продажам оборудования ТСБ
Менеджер по продажам образовательных услуг
Менеджер по продажам окон ПВХ
Менеджер по продажам ореха в скорлупе (фундук, грецкий)
Менеджер по продажам отопления
Менеджер по продажам ПВХ-окон
Менеджер по продажам полиграфической продукции
Менеджер по продажам промышленного вентиляционного оборудования
Менеджер по продажам систем безопасности
Менеджер по продажам стальной трубы и деталей трубопроводов
Менеджер по продажам услуг
Менеджер по продажам услуг интернет-рекламы (контекстная реклама, SEO, сайты)
Менеджер по продажам услуг корпоративным клиентам
Менеджер по продажам услуг ответственного хранения (склад)
Менеджер по продажам услуг по разработке сайтов в веб-студию
Менеджер по продажам услуг сертификации без "холодных" звонков
Менеджер по продажам финансовых продуктов
Менеджер по продажам финансовых продуктов в г. Румянцево
Менеджер по продажам холодильного оборудования
Менеджер по продажам цифровой техники
Менеджер по продажам электротехнического оборудования
Менеджер по продажам юридических услуг
Менеджер по продажам, менеджер по работе с клиентами
Менеджер по продажам, менеджер по работе с клиентами услуг по созданию сайтов, рекламе, маркетолог
Менеджер по продажам, оператор call-центра
Менеджер по продажам, телемаркетолог
Менеджер по продаже автомобилей
Менеджер по продаже готового бизнеса (без холодных звонков)
Менеджер по продаже запасных частей
Менеджер по продаже недвижимости
Менеджер по продаже недвижимости (риэлтор)
Менеджер по продаже систем наблюдения, продавец
Менеджер по продаже элитной недвижимости
Менеджер по работе с артистами
Менеджер по работе с интернет-проектами (контекст, SEO)
Менеджер по работе с клиентами
Менеджер по работе с клиентами (КАМ)
Менеджер по работе с клиентами (менеджер по продажам)
Менеджер по работе с клиентами (менеджер по тендеру)
Менеджер по работе с клиентами / Менеджер по продажам / Account Manager
Менеджер по работе с клиентами, администратор-менеджер
Менеджер по работе с ключевыми клиентами (Key Account Manager/ КАМ)
Менеджер по работе с малым и средним бизнесом
Менеджер по работе с партнерами (с интернет-магазинами)
Менеджер по развитию
Менеджер по развитию бизнеса
Менеджер по развитию бизнеса и сопровождению сделок (оптовая продажа нефтепродуктов)
Менеджер по развитию розничной сети
Менеджер по региональным продажам
Менеджер по СМК
Менеджер по снабжению (закупкам)
Менеджер по страхованию
Менеджер по тендерам
Менеджер по туризму
Менеджер по туризму в ТРЦ "Метрополис"
Менеджер продаж
Менеджер продаж логистических услуг для крупного бизнеса
Менеджер проектов (реклама)
Менеджер ресторана
Менеджер ресторана быстрого питания
Менеджер смены в ТРЦ Columbus
Менеджер торгового зала
Менеджер точки питания
Менеджер, диспетчер транспортного отдела
Менеджер, помощник менедж?ера по работе с клиентами
Менеджер-дизайнер (кухни, корпусная мебель)
Менеджер-дизайнер по производству спортивной обуви
Менеджер-заказа (замерщик окон ПВХ)
Менеджер-кассир в суши-бар
Менеджер-конструктор корпусной мебели
Менеджер-куратор (компьютерная помощь)
Менеджер-оператор
Менеджер-организатор
Менеджер-переводчик
Менеджерпо продажам облачных IT-продуктов
Менежер по продажам
Мерчандайзер стационарный (метро)
Мерчандайзер-консультант
Мерчендайзер
Мерчендайзер в торговый зал
Мерчендайзер г. Москва
Мерчендайзер, продавец
Мерчендайзер, сканировщик
Мерчендайзер-грузчик
Методист
Механик
Механик по обслуживанию систем вентиляции
Младший инспектор отдела охраны
Младший инспектор отдела охраны, инструктор-кинолог
Младший менеджер по торговому маркетингу (мороженое)/Channel Junior Manager IC
Младший помощник юриста
Младший специалист по контекстной рекламе, SEA-assistant
Мобильный администратор
Мобильный кассир
Мобильный мерчендайзер
Мойщик
Мойщик котлов
Мойщик кухонного инвентаря
Мойщик посуды
Мойщица(к)
Монитор Клинических исследований
Монолитчик
Монолитчик, бетонщик-арматурщик
Монтажник
Монтажник АСУ
Монтажник вентилируемых фасадов
Монтажник дымоходов
Монтажник ЖБК
Монтажник конструкций ПВХ
Монтажник лифтов
Монтажник н/т
Монтажник натяжных потолков
Монтажник натяжных потолков с обучением
Монтажник окон ПВХ
Монтажник ОПС
Монтажник пвх и алюминиевых конструкций
Монтажник по монтажу ст. и жб конструкций
Монтажник РЭА
Монтажник рэа и приборов
Монтажник санитарно-технических систем и обор
Монтажник связи
Монтажник систем вентиляции
Монтажник систем вентиляции и кондиционирования
Монтажник слаботочных систем
Монтажник технологических трубопроводов
Монтажник технологических трубопроводов и связанных с ним конструкций резервуара
Монтажник торгового оборудования
Монтажник фасадов из СФБ
Монтажник, помощник монтажника
Монтажники окон ПВХ и АЛ
Монтажник-электрик (монтажник-водитель) рекламных конструкций
Мясник
Мясник в мясной магазин
Наборщик товара
Наладчик оборудования
Наладчик станков ЧПУ
Наладчик, специалист КИПиА
НаладчикТПА (возможно обучение)
Начальник комплексного отдела по эксплуатации основных фондов
Начальник отделения
Начальник охраны
Начальник охраны объекта
Начальник участка (эксплуатация электрооборудования)
Ночной дежурант
Ночной кассир
Ночной продавец цветов
Няня
Няня в Москве, Подмосковье
Няня в семью
Няня в семью к маьчику 1г 6 мес
Няня-воспитатель
Обвальщик мяса
Обвальщик-мясник (ученик)
Обивщик мебели
Обивщик мягкой мебели
Обмотчик элементов электрических машин
Обработчик колбасных изделий
ОБРАБОТЧИК МЯСА ПТИЦЫ (ХАЛЯЛЬ) Вахта
Онлайн-менеджер по работе с клиентами
Оператор
Оператор 1-ой линии поддержки
Оператор 1С
Оператор 1С (продукты питания)
Оператор 1С, ассистент руководителя
Оператор 1С, комплектовщик
Оператор 1С, менеджер по складскому учету
Оператор 1С?-менеджер
Оператор call-центра
Оператор call-центра (без продаж)
Оператор call-центра (входящие звонки)
Оператор call-центра (исходящие звонки)
Оператор call-центра (телемаркетинг)
Оператор call-центра на дому
Оператор call-центра, оператор на телефон, телемаркетолог
Оператор автомата
Оператор автомата по производству
Оператор видеонаблюдения
Оператор для Тинькофф
Оператор домашнего колл-центра
Оператор колл-центра
Оператор колл-центра (без продаж)
Оператор комплектации
Оператор линии
Оператор линии в производстве пищевой продукции
Оператор на линию по чистке рыбной продукции
Оператор на производство
Оператор на телефон
Оператор на телефон в офис
Оператор на телефон, оператор call-центра, телефонист
Оператор на телефоне
Оператор на телефоне (не продажи)
Оператор на экскаватор
Оператор печного отделения
Оператор ПК
Оператор ПК, менеджер
Оператор по набору персонала (Рекрутер)
Оператор по приему заказов на доставку
Оператор по сварке ПЭ труб
Оператор полуавтоматической линии
Оператор прачечной
Оператор производственной линии
Оператор связи
Оператор сканирования
Оператор станка с ЧПУ
Оператор станка ЧПУ
Оператор станков с ЧПУ (токарная и фрезерная группа)
Оператор торгового зала
Оператор упаковочного оборудования
Оператор упаковочной линии
Оператор фальцесклейки petratto
Оператор фальцовки
Оператор фрезеро-гравировального оборудования
Оператор энергоцентра
Оператор-кассир
Оператор-кассир букмекерской конторы
Оператор-наладчик ЧПУ
Оператор-продавец
Оператор-телефонист
Оптик-консультант
Организатор в школу
Организатор встреч
Отделочник
Отделочник на ремонт школ
Отделочник, отделочник-универсал
Отделочник, плотник
Отделочники
Отделочник-мастер
Отделочник-универсал
Отделочник-универсал, "мастер на час"
Офис-менеджер
Офис-менеджер (менеджер складского учета)
Офис-менеджер, административный менеджер проекта
Офис-менеджер, ассистент руководителя
Офис-менеджер, оператор 1С
Офис-менеджер, секретарь
Офисный разнорабочий, строитель
Официант
Официант (м.Белорусская)
Официант (м.Митино)
Официант (м.Технопарк)
Официант в кафе
Официант в ресторан
Официант в ресторан премиум
Официант на яхту
Официант со знанием английского языка
Официант(м.Фрунзенская)
Официантка
Официантка в ночной клуб
Официантка ресторана
Официант-кассир в ресторан быстрого питания
Официанты
Охранник
"""
vacancies = vacancies.split('\n')
dates = [generate_date() for _ in range(100)]
sources = ['Published', 'vacob_123412_12421.xlsx', 'vacob_127712_12411.xlsx', 'vacob_12743062_164386411.xlsx', 'Вакан.xlsx']




vacancies =[
            {
                'id': id + 501,
                'vacancyName': vac,
                'date': choice(dates),
                'source': choice(sources) 
            } for id, vac in enumerate(vacancies[500: ])
        ]



for vac in vacancies:
    print(vac, end=',\n')
